{
    "experiences": [
        {
            "job":"Software Engineer",
            "company": "NEC Asia Pacific",
            "period": "May 2022 - PRESENT",
            "responsibilities": [
                "Backend development using Java Spring Boot to build microservice applications.",
                "Designed and implemented RESTful APIs with Spring Boot, enabling seamless integration with internal and external services.",
                "Developed secure RESTful APIs using JWT tokens for authentication and authorization, integrating with Keycloak for identity access management.",
                "Understanding and familiarizing myself with DevOps tools like Docker and Kubernetes to deploy, scale and troubleshoot microservice applications.",
                "Perform load testing on microservice applications with JMeter to test for functional issues that may arise due to concurrency including performance issues.",
                "Document API specifications using tools like Swagger OpenAPI to ensure clarity and facilitate collaboration within the team."
            ],
            "skills": [
                "Java","Spring Boot", "REST API", "MySQL", "JMeter"
            ]
        },
        {
            "job":"Senior IT Analyst",
            "company": "TransitLink Pte Ltd",
            "period": "Apr 2021 - Dec 2021",
            "responsibilities": [
                "Supporting of Transitlink internal application systems.",
                "Troubleshooting issues in Transitlink applications throughs SQL queries and log checking in servers.",
                "Writing SQL scripts for data analysis and investigations for detecting issues caused by system or business operations.",
                "Writing SQL scripts for data patching due to system or operational issues.",
                "Coordinate with both business and IT side to resolve and enhance current application systems.",
                "Conduct data extraction using SQL for Transcom investigations and Covid-19 contact tracing.",
                "Supporting and coordination of application deployment and verification activities."
            ],
            "skills": [
                "SQL","Data Analysis", "Application Support", "Deployment Support"
            ]
        },
        {
            "job":"VPMS Support Analyst",
            "company": "NTUC Income",
            "period": "Apr 2019 - Apr 2021",
            "responsibilities": [
                "VPMS (Visual Product Modelling System) is a proprietary software used to calculate insurance premiums.",
                "Worked on translating excel formulas used to calculate premiums from Excel spreadsheets, into VPMS.",
                "Conduct testing to ensure correct premiums are calculated from VPMS.",
                "Adhere to project time lines from SIT, UAT and Production and to support incident tickets for issues raised in production."
            ],
            "skills": [
                "SQL","Data Analysis", "Application Support", "Excel", "VPMS"
            ]
        },
        {
            "job":"Master Data Analyst",
            "company": "Procter & Gamble",
            "period": "Feb 2018 - Aug 2018",
            "responsibilities": [
                "Daily export of data from database systems.",
                "Produce daily scorecard reports using excel to identify gaps in data between database systems.",
                "Using excel functions to conduct data analysis to find root cause of data gaps.",
                "Support and coordinate with multi-functional teams to resolve issues found from data gaps.",
                "Incident monitoring and tracking of incident tickets and fulfilment requests to ensure issues from data gaps are resolved and requests are fulfilled."
            ],
            "skills": [
                "Data Analysis", "Excel", "ITSM", "Anaplan"
            ]
        }
    ]
}